sciencequiz-api-p5-erinsusanthomas-main/app/models/student.rb

  def current_team
    curr_team = self.student_teams.current
    return nil if curr_team.empty?
---
SELECT  1 AS one FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) LIMIT ?  [["student_id", 1], ["LIMIT", 1]]