sciencequiz-api-p5-erinsusanthomas-main/app/models/student_quiz.rb

  def student_is_participating_in_this_quiz
    return true if (self.student_id.nil? || self.quiz_id.nil?)
    quiz = Quiz.find(self.quiz_id)
    matchups_for_quiz = quiz.team_quizzes
    ids_for_current_students = matchups_for_quiz.map{ |tq| tq.team.students.map{|s| s.id}}.flatten
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" INNER JOIN "student_teams" ON "students"."id" = "student_teams"."student_id" WHERE "student_teams"."team_id" = ?  [["team_id", 1]]
SELECT "team_quizzes".* FROM "team_quizzes" WHERE "team_quizzes"."quiz_id" = ?  [["quiz_id", 1]]