sciencequiz-api-p5-erinsusanthomas-main/app/models/student_team.rb

  def end_previous_team_assignment
    current_assignment = self.student.student_teams.current.first
---
SELECT  "student_teams".* FROM "student_teams" WHERE "student_teams"."student_id" = ? AND (end_date IS NULL) ORDER BY "student_teams"."id" ASC LIMIT ?  [["student_id", 1], ["LIMIT", 1]]

  def student_is_aligned_with_team_organization
    return true if (self.student_id.nil? || self.team_id.nil?)
    team = Team.find(self.team_id)
    team_organization = team.organization
    team_organization_students_ids = team_organization.students.map{ |s| s.id }
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."organization_id" = ?  [["organization_id", 4]]

  def student_position_is_currently_open
    return true if (self.student_id.nil? || self.team_id.nil?)
    team = Team.find(self.team_id)
    current_assignments_for_this_team = team.student_teams.current
    return true if current_assignments_for_this_team.empty?
    current_positions = current_assignments_for_this_team.map{ |st| st.position }
---
SELECT  "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "student_teams" WHERE "student_teams"."team_id" = ? AND (end_date IS NULL) LIMIT ?  [["team_id", 1], ["LIMIT", 1]]
SELECT "student_teams".* FROM "student_teams" WHERE "student_teams"."team_id" = ? AND (end_date IS NULL)  [["team_id", 1]]