sciencequiz-api-p5-erinsusanthomas-main/app/models/team_quiz.rb

SELECT COUNT(*) FROM "teams" INNER JOIN "team_quizzes" ON "teams"."id" = "team_quizzes"."team_id" WHERE "team_quizzes"."quiz_id" = ?  [["quiz_id", 1]]
---
  def team_matchup_count_less_than_max
    return true if (self.quiz_id.nil? || self.team_id.nil?)
    quiz = Quiz.find(self.quiz_id)
    if quiz.teams.count >= 3

SELECT "team_quizzes".* FROM "team_quizzes" WHERE "team_quizzes"."quiz_id" = ?  [["quiz_id", 1]]
---
  def matchup_position_is_currently_open
    return true if (self.quiz_id.nil? || self.team_id.nil?)
    quiz = Quiz.find(self.quiz_id)
    matchups_for_quiz = quiz.team_quizzes
    current_positions = matchups_for_quiz.map{ |tq| tq.position }

SELECT "teams".* FROM "teams" INNER JOIN "team_quizzes" ON "teams"."id" = "team_quizzes"."team_id" WHERE "team_quizzes"."quiz_id" = ?  [["quiz_id", 1]]
---
  def matchup_is_not_a_repeat
    return true if (self.quiz_id.nil? || self.team_id.nil?)
    quiz = Quiz.find(self.quiz_id)
    teams_for_quiz = quiz.teams
    current_team_ids = teams_for_quiz.map{ |t| t.id }