sciencequiz-api-p5-erinsusanthomas-main/app/controllers/organizations_controller.rb

    def index
      @organizations = Organization.active.alphabetical.all
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."active" = ? ORDER BY name  [["active", 1]]

    def create
      @organization = Organization.new(organization_params)

      if @organization.save
---
INSERT INTO "organizations" ("name", "street_1", "city", "state", "zip", "short_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def update
      if @organization.update(organization_params)
---
UPDATE "organizations" SET "short_name" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["short_name", "STANFORD"], ["updated_at", "2021-05-02 12:24:14.008365"], ["id", 8]]

    def set_organization
        @organization = Organization.find(params[:id])
---
SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]