sciencequiz-api-p5-erinsusanthomas-main/app/serializers/organization_serializer.rb

SELECT  1 AS one FROM "teams" WHERE "teams"."organization_id" = ? AND "teams"."active" = ? LIMIT ?  [["organization_id", 1], ["active", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."organization_id" = ? AND "teams"."active" = ?  [["organization_id", 4], ["active", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."organization_id" = ? AND "teams"."active" = ?  [["organization_id", 1], ["active", 1]]
---
  attributes :name, :street_1, :city, :state, :zip, :short_name

  attribute :active_teams do |object|
    if object.teams.active.empty?
      "No active teams currently!"
    else
      object.teams.active.map do |team|

SELECT "teams".* FROM "teams" WHERE "teams"."organization_id" = ? AND "teams"."active" != ?  [["organization_id", 4], ["active", 1]]
SELECT  1 AS one FROM "teams" WHERE "teams"."organization_id" = ? AND "teams"."active" != ? LIMIT ?  [["organization_id", 1], ["active", 1], ["LIMIT", 1]]
---
  end

  attribute :inactive_teams do |object|
    if object.teams.inactive.empty?
      "No inactive teams currently!"
    else
      object.teams.inactive.map do |team|