sciencequiz-api-p5-erinsusanthomas-main/app/serializers/team_serializer.rb

SELECT COUNT(*) FROM "students" INNER JOIN "student_teams" ON "students"."id" = "student_teams"."student_id" WHERE "student_teams"."team_id" = ?  [["team_id", 2]]
---
  end

  attribute :number_students do |object|
    object.students.count